lvx/base/InformationRegisters/бит_ВложенияВизЭлектроннойПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ВложенияВизЭлектроннойПочты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МенеджерПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьУсловияВидимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектВизирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Enums/бит_фн_ВидыСобытийОповещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_фн_ВидыСобытийОповещений</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументыДляВизирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоступнаВиза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписанДокумент</Name>
					<Comment>Записан документ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписанСправочник</Name>
					<Comment>Записан справочник</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененоСостояниеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененоСостояниеПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НапоминанияПоГрафикуНачислений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НапоминанияПоГрафикуПлатежей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеСрокаДействияДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтмененоПроведениеДокумента</Name>
					<Comment>Отменено проведение документа</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоРешение</Name>
					<Comment>Принято решение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроведенДокумент</Name>
					<Comment>Проведен документ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановленСтатус</Name>
					<Comment>Установлен статус</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененаДатаПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НапоминанияОбОплате</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/CommonModules/бит_ОповещенияПовтИсп/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ЕстьНастройкаОповещения(ОбъектСистемы) Экспорт
	
	ВидСобытия = Новый Массив;
	ВидСобытия.Добавить(Перечисления.бит_фн_ВидыСобытийОповещений.ЗаписанДокумент);
	ВидСобытия.Добавить(Перечисления.бит_фн_ВидыСобытийОповещений.ПроведенДокумент);
	ВидСобытия.Добавить(Перечисления.бит_фн_ВидыСобытийОповещений.ОтмененоПроведениеДокумента);
	ВидСобытия.Добавить(Перечисления.бит_фн_ВидыСобытийОповещений.ЗаписанСправочник);
	ВидСобытия.Добавить(Перечисления.бит_фн_ВидыСобытийОповещений.ИзмененаДатаПлатежа);
	
	ТаблицаОповещений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_фн_АктивныеОповещения");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектСистемы",		ОбъектСистемы);
	Запрос.УстановитьПараметр("ВидСобытия",			ВидСобытия);
	Запрос.УстановитьПараметр("ТаблицаОповещений",	ТаблицаОповещений);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаОповещений.Оповещение КАК Оповещение,
	|	ТаблицаОповещений.ВидСобытия КАК ВидСобытия,
	|	ТаблицаОповещений.ОбъектСистемы КАК ОбъектСистемы
	|ПОМЕСТИТЬ ТаблицаОповещений
	|ИЗ
	|	&ТаблицаОповещений КАК ТаблицаОповещений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаОповещений.Оповещение КАК Оповещение
	|ИЗ
	|	ТаблицаОповещений КАК ТаблицаОповещений
	|ГДЕ
	|	ТаблицаОповещений.ВидСобытия В(&ВидСобытия)
	|	И ТаблицаОповещений.ОбъектСистемы = &ОбъектСистемы";
	
	Результат = Запрос.Выполнить();

	Возврат НЕ Результат.Пустой();
	
КонецФункции

// Функция возвращает коллекцию параметров печатных форм,
//	которые необходимо вложить к объекту при отправке по почте.
// 
// Параметры:
// 	ПолноеИмяМетаданных - Строка.
// 
// Возвращаемое значение:
// 	Массив. Элемент массива - Стурктура:
//		ИмяОбъекта    - Строка - Полное имя объекта метаданных
//		Идентификатор - Строка - Идентификатор печатной формы
//		Представление - Строка - Представление печатной формы
//		ВнешняяОбработка - СправочникСсылка.ДополнительныеОтчетыИОбработки - Ссылка на обработку печатной формы (если используется внешняя).
//		МенеджерПечати   - Строка - Имя менеджера печати. Если пустая, то менеджером выступает сам объект.
//		ЕстьУсловияВидимости - Булево - Признак наличия условий видимости печатной формы для каждого объекта.
//
Функция ПараметрыВложенийЭлектроннойПочты(ПолноеИмяМетаданных) Экспорт
	
	ПараметрыВложений = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Вложения.Идентификатор КАК Идентификатор,
	|	Вложения.Представление КАК Представление,
	|	Вложения.ВнешняяОбработка КАК ВнешняяОбработка,
	|	Вложения.МенеджерПечати КАК МенеджерПечати,
	|	Вложения.ЕстьУсловияВидимости КАК ЕстьУсловияВидимости
	|ИЗ
	|	РегистрСведений.бит_ВложенияВизЭлектроннойПочты КАК Вложения
	|ГДЕ
	|	Вложения.ОбъектВизирования = &ОбъектВизирования";
	Запрос.УстановитьПараметр("ОбъектВизирования", ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмяМетаданных));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Вложение = НовыеПараметрыВложенияЭлектроннойПочты();
		ЗаполнитьЗначенияСвойств(Вложение, Выборка);
		Вложение.ИмяОбъекта = ПолноеИмяМетаданных;
		ДобавитьУсловияВидимостиВложения(Вложение);
		ПараметрыВложений.Добавить(Вложение);
	КонецЦикла;
	
	Возврат ПараметрыВложений;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыеПараметрыВложенияЭлектроннойПочты()
	
	ПараметрыВложения = Новый Структура;
	ПараметрыВложения.Вставить("ИмяОбъекта",           "");
	ПараметрыВложения.Вставить("Идентификатор",        "");
	ПараметрыВложения.Вставить("Представление",        "");
	ПараметрыВложения.Вставить("ВнешняяОбработка",     Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка());
	ПараметрыВложения.Вставить("МенеджерПечати",       "");
	ПараметрыВложения.Вставить("ЕстьУсловияВидимости", Ложь);
	ПараметрыВложения.Вставить("УсловияВидимости",     Новый Массив);
		
	Возврат ПараметрыВложения;
	
КонецФункции

Процедура ДобавитьУсловияВидимостиВложения(ПараметрыВложения)
	
	Если НЕ ПараметрыВложения.ЕстьУсловияВидимости Тогда
		Возврат;
	КонецЕсли;
			
	КэшФормы       = ПодключаемыеКомандыПовтИсп.КэшФормы("", ПараметрыВложения.ИмяОбъекта, Истина);
	КомандаОбъекта = КэшФормы.Команды.Найти(ПараметрыВложения.Идентификатор, "Идентификатор");
	Если КомандаОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВложения.УсловияВидимости = КомандаОбъекта.УсловияВидимости;
	
КонецПроцедуры

#КонецОбласти
